4.0.8a/ISO8583Server/ISO8583TestClient/TestFileIn.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ISO8583Request xmlns="http://mitug.co.il/MultiXTpm/ISO8583WS" xmlns:ISO8583WS11="http://mitug.co.il/MultiXTpm/ISO8583WS/ISO8583WSSoap"
						 xmlns:ISO8583WS="http://mitug.co.il/MultiXTpm/ISO8583WS"
						 xmlns:ISO8583WS12="http://mitug.co.il/MultiXTpm/ISO8583WS/ISO8583WSSoap12">
			<ISO8583Msgs>
				<ISO8583WS:CISO8583Msg>
					<ISO8583WS:MTI>100</ISO8583WS:MTI>
					<ISO8583WS:AlphaNumericElements>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>2</ISO8583WS:ID>
							<ISO8583WS:Value>800123</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>4</ISO8583WS:ID>
							<ISO8583WS:Value>000000001050</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>11</ISO8583WS:ID>
							<ISO8583WS:Value>123456</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>42</ISO8583WS:ID>
							<ISO8583WS:Value>000000000800456</ISO8583WS:Value>
						</ISO8583WS:AlNum>
					</ISO8583WS:AlphaNumericElements>
				</ISO8583WS:CISO8583Msg>
				<ISO8583WS:CISO8583Msg>
					<ISO8583WS:MTI>200</ISO8583WS:MTI>
					<ISO8583WS:AlphaNumericElements>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>2</ISO8583WS:ID>
							<ISO8583WS:Value>800123</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>4</ISO8583WS:ID>
							<ISO8583WS:Value>000000001050</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>11</ISO8583WS:ID>
							<ISO8583WS:Value>123456</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>42</ISO8583WS:ID>
							<ISO8583WS:Value>000000000800456</ISO8583WS:Value>
						</ISO8583WS:AlNum>
					</ISO8583WS:AlphaNumericElements>
				</ISO8583WS:CISO8583Msg>
				<ISO8583WS:CISO8583Msg>
					<ISO8583WS:MTI>100</ISO8583WS:MTI>
					<ISO8583WS:AlphaNumericElements>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>2</ISO8583WS:ID>
							<ISO8583WS:Value>700123</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>4</ISO8583WS:ID>
							<ISO8583WS:Value>000000001050</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>11</ISO8583WS:ID>
							<ISO8583WS:Value>123456</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>42</ISO8583WS:ID>
							<ISO8583WS:Value>000000000800456</ISO8583WS:Value>
						</ISO8583WS:AlNum>
					</ISO8583WS:AlphaNumericElements>
				</ISO8583WS:CISO8583Msg>
				<ISO8583WS:CISO8583Msg>
					<ISO8583WS:MTI>200</ISO8583WS:MTI>
					<ISO8583WS:AlphaNumericElements>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>2</ISO8583WS:ID>
							<ISO8583WS:Value>700123</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>4</ISO8583WS:ID>
							<ISO8583WS:Value>000000001050</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>11</ISO8583WS:ID>
							<ISO8583WS:Value>123456</ISO8583WS:Value>
						</ISO8583WS:AlNum>
						<ISO8583WS:AlNum>
							<ISO8583WS:ID>42</ISO8583WS:ID>
							<ISO8583WS:Value>000000000800456</ISO8583WS:Value>
						</ISO8583WS:AlNum>
					</ISO8583WS:AlphaNumericElements>
				</ISO8583WS:CISO8583Msg>
			</ISO8583Msgs>
		</ISO8583Request>
	</soap:Body>
</soap:Envelope>

